Revit 2027 API
IUpdater.GetAdditionalInformation Method
 Auxiliary text that Revit will use to inform the end user when the Updater is not loaded
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
string GetAdditionalInformation()
Function GetAdditionalInformation As String
String^ GetAdditionalInformation()
abstract GetAdditionalInformation : unit -> string
Return Value
String
See Also
Reference
IUpdater Interface
Autodesk.Revit.DB Namespace